spec/vcr/SpreeAvataxCertified_Line/return_invoice/build_lines/receives_method_refund_lines.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R837534265","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #25 - 8863","TaxCode":"PC030000","ItemCode":"SKU-25","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R837534265","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:33:19 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '559'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1NZ++Orj34P69/b1P7+sXT7OWv9jb2X24vXNve28HX7wpFnnTZotV+NWb3U8f3bv3aPfB+MHDhzu79/d/ihtXbVYeL6r1skXzXYGAD58WzdR87D49fZcvVm1RLcOP32TvsknJyHgg6FN8sjPe9z86ycrpuiTUZ/6X2bvnxTJv6KPvJUQP/PGior8+2t1+fqYtDCFenuzc26FHP84mRVm01/imrdc5Pn1CmM+y+vp5fpmX+OJ4NquVov0h9IcKoP5wXhG6+GtnvLNPHfNn1Eg+MgMYGtjTvM2K0g7tBF3VjO5Xr9HkVX6h2Bw/x9/fWddF8+Z6xT2+bgmg/dRQYGcXHxHs90WTobzIFtzs+Pnxk+MvjvE5tXKfpq/fHL85Td8c/94f/ZLk+wn+L02Uim6a9AP686OHu/fT1+l3sunbplqmr1tA1a8N1k+JL/Hxic7WF9WyvagWOREDn3bp8rIiNi7Ny/c+3d3hIXTJRXjJR2dM972d+3vE4fiGB2ve39ndJa7fBVV+STJ6b9y/rIsLfPxzj7uZjIj0/5Lk/wFMbuK8SwQAAA==
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:33:19 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R837534265","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #25 - 8863","TaxCode":"PC030000","ItemCode":"SKU-25","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R837534265","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:33:20 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '697'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvTq49+D+vf29T+9/NOIvnmYtf7G3s/twe+fe9t4OvnhTLPKmzRar8Ks3u58+unfv0d7u+NOHDz69v7v7U9y4arPyeFGtly2a7zJo/vBp0UzNxwIXn56+yxertqiW4cdvsnfZpGRkPBD0KT7ZGX/qf3SSldN1SajP/C+zdwOjyd49L5Z5Q998LyF64I8XFf310e728zNtYSj08mTn3g49+nE2KcqivcY3bb3O8ekTGtIsq6+f55d5iS+OZ7M6bxp8x2/oIBjEK8VoZ7yzT1D5M2okH+3jrz6RCJnO+LhhhG404rzNitIOjT553/5f5RcK8/g5/j4BMjWP+KvX+OA767po3lyvGM7rFgDNpy+yBX96/Pz4yfEXx/ZzQ8ydXXxE/bmG6es3x29O0zfHv/dHvyT5fvJLkhGh7c/Is1f6jgHy7BXhTY9+/J4z0qdajOCGaMx4G2m2p391p8h83pmQHjW75GZ6xalrCGCp+J5YMhBHeTtF1Mp92puP7yfSRGnoxEY/oD8/erh7P32dfiebvm2qZfq6BVT92iD9lBQIPj7RufqiWrYX1SInWuDTLlleVqRvSvPyvU93d6LMSXjJR2dM9r2d+3sPHj7ENzxY8/7O7u7O7v1dUEUYTJHDd7uf7uykL/PlsrkuL7NlkaXHl3n64rsAos0MGKaiGcB3s2ZeLC9aQgefbh4AIUZ908eCLT56eoK/OwN4uN9HnnDXh5Dn2XiVN+uyNd+/Xk+nhORHvyT5fwBlBaZm3AUAAA==
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:33:20 GMT
recorded_with: VCR 4.0.0
