spec/vcr/SpreeAvataxCertified_Line/sales_order/_shipment_line/returns_a_Hash.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R023468968","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #24 - 5230","TaxCode":"PC030000","ItemCode":"SKU-24","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R023468968","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:33:15 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '560'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z1723s7+OJNscibNluswq/e7H766N69R7ufjg8efLpz8OnBT3Hjqs3K40W1XrZovisQ8OHTopmaj92np+/yxaotqmX48ZvsXTYpGRkPBH2KT3bG+/5HJ1k5XZeE+sz/MnsXHw0N0wz+1c7evf1PDx5+eoAv6I3nxTJv6JvvJUQo/PGior8+2t1+fqYtzKsvT3bu7dCjH2eToizaa3zT1uscnz6hsc6y+vp5fpmX+OJ4NquV1P1B94kDoD4BXulodsY7+9Qxf0aN5CMz5EFS5G1WlHZoJ+iqZnS/eo0mr/ILxeb4Of7+zroumjfXK+7xdUsA7aeGAju7+Ihgvy+aDOVFtuBmx8+Pnxx/cYzPqZX7NH395vjNafrm+Pf+6Jck30/wf2miVHTTpB/Qnx893L2fvk6/k03fNtUyfd0Cqn5tsH5KnIyPT3S2vqiW7UW1yIkY+LRLl5cVMX5pXr736e4OD6FLLsJLPjpjuu/t3N978PAhvuHBmvd3dnd3du/vgiq/JBm9N+5f1sUFPv65xx0T8v8AEYrdWEsEAAA=
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:33:15 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R023468968","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #24 - 5230","TaxCode":"PC030000","ItemCode":"SKU-24","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R023468968","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:33:17 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '672'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z1723s7+OJNscibNluswq/e7H766N69R7sH473de/d2Hx78FDeu2qw8XlTrZYvmu/fth0+LZmo+Frj49PRdvli1RbUMP36TvcsmJSPjgaBP8cnO+FP/o5OsnK5LQn3mf5m9i4+GhmkG/2pn797+pwcPPz3AF/TG82KZN/TN9xIiFP54UdFfH+1uPz/TFubVlyc793bo0Y+zSVEW7TW+aet1jk+f0FhnWX39PL/MS3xxPJvVSur+oPvEAVAlAH/wSkezM97Zp475M2okH+3rX11SmM+f5m1WlHZoJ+iqZnS/eo0mr/ILxeb4Of7+zroumjfXK+7xdUsA7aeGAju7+Ihgvy+aDOVFtuBmx8+Pnxx/cYzPqZX7NH395vjNafrm+Pf+6Jck309+STIitP0ZefZK3zH4PHtFvdGjH/+szghz5MaR7ulf3Qkxn/8wJuSWWDIQR/lbzsf3E2miNHRiox/Qnx893L2fvk6/k03fNtUyfd0Cqn5tkH5KmgUfn+hcfVEt24tqkRMt8GmXLC8rUkSlefnep7s7zFJdahFe8tEZk31v5/7eg4cP8Q0P1ry/s7u7s3t/F1QRBlPk8N3upzs76ct8uWyuy8tsWWTp8WWevvgugGgzA4apaAbw3ayZF8uLltDBp5sHQIhR3/SxYIuPnp7g784AHu73kSfc9SHkMSP/D6NiG4XcBQAA
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:33:17 GMT
recorded_with: VCR 4.0.0
